Repository: J-Pabon/ouisync-app
Catalog: lib/l10n/intl_*.arb
Languages: fr

# iconShareTokenWithPeer
source: Share this with your peer
fr: Partager ceci avec vos pairs

# actionCreateRepository
source: Create Repository
fr: Créer un dépôt

# actionAddRepository
source: Import a Repository
fr: Importer un dépôt

# actionAddRepositoryWithToken
source: Import Repository
fr: Importer le dépôt

# actionReloadContents
source: Reload
fr: Actualiser

# actionNewRepo
source: Create repository
fr: Créer le dépôt

# actionImportRepo
source: Import repository
fr: Importer le dépôt

# actionReloadRepo
source: Reload repository
fr: Actualiser le dépôt

# actionRemoveRepo
source: Remove repository
fr: Supprimer le dépôt

# actionNewFolder
source: Folder
fr: Dossier

# actionNewFile
source: File
fr: Fichier

# actionCreate
source: Create
fr: Créer

# actionCancel
source: Cancel
fr: Annuler

# actionDelete
source: Delete
fr: Supprimer

# actionMove
source: Move
fr: Déplacer

# actionSave
source: Save
fr: Enregistrer

# actionUnlock
source: Unlock
fr: Déverrouiller

# actionRetry
source: Retry
fr: Réessayer

# actionShare
source: Share
fr: Partager

# actionRename
source: Rename
fr: Renommer

# actionAccept
source: Accept
fr: Accepter

# actionDeleteFolder
source: Delete folder
fr: Supprimer le dossier

# actionPreviewFile
source: Preview file
fr: Aperçu du fichier

# actionShareFile
source: Share file
fr: Partager le fichier

# actionDeleteFile
source: Delete file
fr: Supprimer le fichier

# actionEditRepositoryName
source: Edit name
fr: Modifier le nom

# actionDeleteRepository
source: Delete repository
fr: Supprimer le dépôt

# actionShow
source: Show
fr: Afficher

# actionHide
source: Hide
fr: Masquer

# actionExit
source: Exit
fr: Quitter

# actionScanQR
source: Scan a QR code
fr: Scanner un code QR

# actionAcceptCapital
source: ACCEPT
fr: ACCEPTER

# actionCancelCapital
source: CANCEL
fr: ANNULER

# actionHideCapital
source: HIDE
fr: MASQUER

# actionCloseCapital
source: CLOSE
fr: FERMER

# actionDeleteCapital
source: DELETE
fr: SUPPRIMER

# actionLockCapital
source: LOCK
fr: VERROUILLER

# actionRemove
source: Remove
fr: Supprimer

# actionDiscard
source: Discard
fr: Annuler

# actionClear
source: Clear
fr: Effacer

# actionSaveChanges
source: Save changes
fr: Enregistrer les modifications

# actionGoToSettings
source: Go to settings
fr: Aller aux paramètres

# actionUndo
source: Undo
fr: Annuler

# actionBack
source: Back
fr: Retour

# actionImport
source: Import
fr: Importer
