Repository: J-Pabon/ouisync-app
Catalog: lib/l10n/intl_*.arb
Languages: fr

# titleAbout
source: About
fr: À propos

# titleAddFile
source: Add file to OuiSync
fr: Ajouter un fichier à OuiSync

# titleMovingEntry
source: Moving entry
fr: Déplacer l'entrée

# titleFolderActions
source: Add
fr: Ajouter

# titleCreateFolder
source: Create a folder
fr: Créer un dossier

# titleCreateRepository
source: Create a new repository
fr: Créer un nouveau dépôt

# titleEditRepository
source: Edit repository
fr: Modifier le dépôt

# titleUnlockRepository
source: Unlock repository
fr: Déverrouiller le dépôt

# titleAddRepository
source: Import a repository
fr: Importer un dépôt

# titleSettings
source: Settings
fr: Paramètres

# titleRepository
source: Repository
fr: Dépôt

# titleFileDetails
source: File details
fr: Informations du fichier

# titleFolderDetails
source: Folder details
fr: Informations du dossier

# titleDeleteFolder
source: Delete folder
fr: Supprimer le dossier

# titleDeleteNotEmptyFolder
source: Delete non-empty folder
fr: Supprimer le dossier non vide

# titleRepositoriesList
source: Your repositories
fr: Vos dépôts

# titleShareRepository
source: Share repository "{name}"
fr: Partager le dépôt « {name} »

# titleDeleteFile
source: Delete file
fr: Supprimer le fichier

# titleNetwork
source: Network
fr: Réseau

# titleLogs
source: Logs
fr: Journaux

# titleDeleteRepository
source: Delete repository
fr: Supprimer le dépôt

# titleDownloadToDevice
source: Download to device
fr: Télécharger sur l'appareil

# titleDownloadLocation
source: Download location
fr: Emplacement de téléchargement

# titleBackgroundAndroidPermissionsTitle
source: Permissions needed
fr: Permissions requises

# titleLockAllRepos
source: Lock all repositories
fr: Verrouiller tous les dépôts

# titleAddRepoToken
source: Import a repository with token
fr: Importer un dépôt avec un jeton

# titleScanRepoQR
source: Scan Repository QR
fr: Scanner le code QR du dépôt

# titleFileExtensionChanged
source: File extension changed
fr: Extension de fichier modifiée

# titleFileExtensionMissing
source: File extension missing
fr: Extension de fichier manquante

# titleSecurity
source: Security
fr: Sécurité

# titleRemoveBiometrics
source: Remove biometrics
fr: Supprimer les informations biométriques

# titleStateMonitor
source: State Monitor
fr: Moniteur d'état

# titleRepositoryName
source: Repository name
fr: Nom du dépôt

# titleUnsavedChanges
source: Unsaved changes
fr: Modifications non enregistrées

# titleChangePassword
source: Change password
fr: Modifier le mot de passe

# titleSetPasswordFor
source: Set password for
fr: Définir un mot de passe pour

# titleSaveChanges
source: Save changes
fr: Enregistrer les modifications

# titleRequiredPermission
source: Required permission
fr: Permission requise

# typeFolder
source: Folder
fr: Dossier

# typeFile
source: File
fr: Fichier

# labelRepositoryLink
source: Repository link:
fr: Lien du dépôt :

# labelName
source: Name:
fr: Nom :

# labelNewName
source: New name:
fr: Nouveau nom :

# labelLocation
source: Location:
fr: Emplacement :

# labelSize
source: Size:
fr: Taille :

# labelPassword
source: Password:
fr: Mot de passe :

# labelRetypePassword
source: Retype password:
fr: Confirmez le mot de passe :

# labelTypePassword
source: Type password:
fr: Entrez le mot de passe :

# labelSyncStatus
source: Sync Status:
fr: État de synchronisation :

# labelSelectRepository
source: Select repository
fr: Sélectionner un dépôt :

# labelRenameRepository
source: Enter the new name:
fr: Entrez le nouveau nom :

# labelEndpoint
source: Endpoint:
fr: Point de terminaison :

# labelAppVersion
source: App version
fr: Version de l'application

# labelPeers
source: Peers
fr: Pairs

# labelUseExternalStorage
source: Use external storage
fr: Utiliser le stockage externe

# labelDownloadedTo
source: Downloaded to:
fr: Téléchargé vers :

# labelSetPermission
source: Set permission
fr: Accorder la permission

# labelTokenLink
source: Repository share link
fr: Lien de partage du dépôt

# labelCopyLink
source: Copy link
fr: Copier le lien

# labelShareLink
source: Share link
fr: Partager le lien

# labelQRCode
source: QR code
fr: Code QR

# labelLockAllRepos
source: Lock all
fr: Tout verrouiller

# messageNoRepoIsSelected
source: No repository is selected
fr: Aucun dépôt sélectionné

# messageRepositoryIsNotOpen
source: The repository is not open
fr: Le dépôt n'est pas ouvert

# messageLoadingDefault
source: Loading…
fr: Chargement…

# messageLibraryPanic
source: Internal crash detected.
fr: Une erreur interne s'est produite.

# messageSyncingIsDisabledOnMobileInternet
source: Syncing is disabled while using mobile internet
fr: La synchronisation est désactivée lors de l'utilisation des données mobiles

# messageNetworkIsUnavailable
source: Network is unavailable
fr: Réseau indisponible

# messageNewVersionIsAvailable
source: A new version is available.
fr: Une nouvelle version est disponible.

# messageErrorDefault
source: Something went wrong. Please try again.
fr: Une erreur s'est produite. Veuillez réessayer.

# messageErrorDefaultShort
source: Failed.
fr: Échec.

# messageErrorLoadingContents
source: We couldn’t load this folder's contents. Please try again.
fr: Nous n'avons pas pu charger le contenu de ce dossier. Veuillez réessayer.

# messageErrorFormValidatorNameDefault
source: Please enter a valid name.
fr: Veuillez entrer un nom valide.

# messageErrorPathNotEmpty
source: {path} is not empty
fr: {path} n'est pas vide

# messageErrorCurrentPathMissing
source: The current folder is missing, navigating to its parent: {path}
fr: Le dossier courant est manquant, navigation vers le dossier parent : {path}

# messageNewFileError
source: Error creating file {name}
fr: Erreur lors de la création du fichier {name}

# messageWritingFileError
source: {name} - writing failed
fr: {name} - échec de l'écriture

# messageDownloadingFileError
source: {name} - download failed
fr: {name} - échec du téléchargement

# messageErrorEntryNotFound
source: entry not found
fr: entrée non trouvée

# messageErrorCreatingRepository
source: Error creating the repository
fr: Erreur lors de la création du dépôt

# messsageFailedCreateRepository
source: Failed to create repository {name}
fr: Échec de la création du dépôt {name}

# messsageFailedAddRepository
source: Failed to import repository {name}
fr: Échec de l'import du dépôt {name}

# messageErrorRepositoryNameExist
source: There is already a repository with this name
fr: Il y a déjà un dépôt avec ce nom

# messageErrorCharactersNotAllowed
source: Using \ or / is not allowed
fr: L'utilisation de \ ou / n'est pas autorisée

# messageBlindReplicaExplanation
source: Your peer cannot write nor read the contents
fr: Votre pair ne peut ni écrire ni lire le contenu

# messageReadReplicaExplanation
source: Cannot be modified, just access the contents
fr: Ne peut être modifié, il suffit d'accéder au contenu

# messageWriteReplicaExplanation
source: Full access. Your peer can read and write
fr: Accès complet. Votre pair peut lire et écrire

# messageNoRepo
source: Before adding files, you need to create a repository
fr: Avant d'ajouter des fichiers, vous devez créer un dépôt

# messageCreateNewRepo
source: Create a new <bold>repository</bold>, or link to one from a friend using a <bold>repository token</bold>
fr: Créez un nouveau <bold>dépôt</bold>, ou associez celui d'un ami en utilisant le <bold>jeton du dépôt</bold>

# messageNoRepos
source: No repositories found
fr: Aucun dépôt trouvé

# messageEmptyRepo
source: This <bold>repository</bold> is empty
fr: Ce <bold>dépôt</bold> est vide

# messageEmptyFolder
source: This <bold>folder</bold> is empty
fr: Ce <bold>dossier</bold> est vide

# messageCreateAddNewItem
source: Create a new <bold>folder</bold>, or add a <bold>file</bold>, using <icon></icon>
fr: Créez un nouveau <bold>dossier</bold> ou ajoutez un <bold>fichier</bold> en utilisant <icon></icon>

# messageReadOnlyContents
source: This repository is <bold>read-only</bold>.
fr: Ce dépôt est <bold>en lecture seule</bold>.

# messageLockedRepository
source: This <bold>repository</bold> is locked.
fr: Ce <bold>dépôt</bold> est verrouillé.

# messageBlindRepository
source: This repository is a blind replica.
fr: Ce dépôt est une réplique aveugle.

# messageBlindRepositoryContent
source: The provided <bold>password</bold> does not grant you access to view the content of this repository.
fr: Le <bold>mot de passe</bold> fourni ne vous donne pas accès au contenu de ce dépôt.

# messageInputPasswordToUnlock
source: Tap on the <bold>Unlock</bold> button and input the password to access content in this repository.
fr: Cliquez sur le bouton <bold>Déverrouiller</bold> et entrez le mot de passe pour accéder au contenu de ce dépôt.

# messageUnlockRepository
source: Enter password to unlock
fr: Entrez le mot de passe pour déverrouiller

# messageRenameRepository
source: Rename repository
fr: Renommer le dépôt

# messageRenameFile
source: Rename file
fr: Renommer le fichier

# messageRenameFolder
source: Rename folder
fr: Renommer le dossier

# messageWritingFileCanceled
source: {name} writing canceled
fr: Écriture de {name} annulée

# messageDownloadingFileCanceled
source: {name} - downloading canceled
fr: {name} - téléchargement annulé

# messageRepositoryAlreadyExist
source: This repository already exists in the app under the name "{name}".
fr: Ce dépôt existe déjà dans l'application avec le nom « {name} ».

# messageMovingEntry
source: This function is not available when moving an entry.
fr: Cette fonction n'est pas disponible lors du déplacement d'une entrée.

# messageRepositoryToken
source: Paste the link here
fr: Collez le lien ici

# messageRepositoryName
source: Give the repository a name
fr: Donnez un nom au dépôt

# messageRepositoryNewName
source: Repository new name
fr: Nouveau nom du dépôt

# messageRepositoryAccessMode
source: Access mode granted: {access}
fr: Mode d'accès accordé : {access}

# messageRepositorySuggestedName
source: Suggested: {name} (tap here to use this name)
fr: Suggéré : {name} (appuyez ici pour utiliser ce nom)

# messageRepositoryPassword
source: Password
fr: Mot de passe

# messageRepositoryNewPassword
source: New password
fr: Nouveau mot de passe

# messageErrorRepositoryPasswordValidation
source: Please enter a password.
fr: Veuillez entrer un mot de passe.

# messageErrorRetypePassword
source: The passwords do not match.
fr: Les mots de passe ne correspondent pas.

# messageErrorNewPasswordSameOldPassword
source: The new password is the same as the old password
fr: Le nouveau mot de passe est identique à l'ancien

# messageErrorTokenInvalid
source: This token is invalid.
fr: Ce jeton est invalide.

# messageErrorTokenValidator
source: Please enter a valid token.
fr: Veuillez entrer un jeton valide.

# messageErrorTokenEmpty
source: Please enter a token.
fr: Veuillez entrer un jeton.

# messageFolderName
source: Folder name
fr: Nom du dossier

# messageConfirmFolderDeletion
source: Are you sure you want to delete this folder?
fr: Voulez-vous vraiment supprimer ce dossier ?

# messageConfirmNotEmptyFolderDeletion
source: This folder is not empty. Do you still want to delete it? (this will delete all its contents)
fr: Ce dossier n'est pas vide. Voulez-vous vraiment le supprimer ? (Cela supprimera l'intégralité de son contenu)

# messageError
source: Error!
fr: Erreur !

# messageAck
source: Ack!
fr: Oups !

# messageCreatingToken
source: Creating the share token…
fr: Création du jeton de partage…

# messageErrorCreatingToken
source: Error creating the share token.
fr: Erreur lors de la création du jeton de partage.

# messageTokenCopiedToClipboard
source: Repository token copied to the clipboard.
fr: Le jeton du dépôt a été copié dans le presse-papiers.

# messageMoveEntryOrigin
source: from {path}
fr: de {path}

# messageConfirmFileDeletion
source: Are you sure you want to delete this file?
fr: Voulez-vous vraiment supprimer ce fichier ?

# messageConfirmRepositoryDeletion
source: Are you sure you want to delete this repository?
fr: Voulez-vous vraiment supprimer ce dépôt ?

# mesageNoMediaPresent
source: There is no media present.
fr: Il n'y a aucun média.

# messageEntryTypeDefault
source: An entry
fr: Une entrée

# messageEntryTypeFolder
source: A folder
fr: Un dossier

# messageEntryTypeFile
source: A file
fr: Un fichier

# messageEntryAlreadyExist
source: {entry} already exists.
fr: {entry} existe déjà.

# messageFolderDeleted
source: Folder deleted successfully: {name}
fr: Le dossier a bien été supprimé : {name}

# messageExitOuiSync
source: Press back again to exit.
fr: Appuyez à nouveau sur retour pour quitter.

# messageInitializing
source: Initializing…
fr: Initialisation…

# messageAddingFileToLockedRepository
source: This repository is locked or is a blind replica. If you have the password, unlock it and try again.
fr: Ce dépôt est verrouillé ou est une réplique aveugle. Si vous avez le mot de passe, déverrouillez-le et réessayez.

# messageAddingFileToReadRepository
source: This repository is a read-only replica.
fr: Ce dépôt est une copie en lecture seule.

# messageFileName
source: File name
fr: Nom du fichier

# messageSelectLocation
source: Select the location
fr: Sélectionner l'emplacement

# messageSaveToLocation
source: Save the file to this folder
fr: Enregistrer le fichier dans ce dossier

# messageFilePreviewNotAvailable
source: File preview is not yet available
fr: L'aperçu du fichier n'est pas encore disponible

# messageBackgroundNotificationAndroid
source: OuiSync is running
fr: OuiSync est en cours d'exécution

# messageBackgroundAndroidPermissions
source: Shortly the OS will ask you for permission to execute this app in the background. This is required in order to keep syncing while the app is not in the foreground
fr: Le système d'exploitation vous demandera bientôt l'autorisation d'exécuter cette application en arrière-plan. Cette autorisation est nécessaire pour poursuivre la synchronisation lorsque l'application n'est pas ouverte

# messageSelectAccessMode
source: Select a permission to create a share link
fr: Sélectionnez une autorisation pour créer un lien de partage

# messageNothingHereYet
source: Nothing here yet!
fr: Il n'y a rien ici pour l'instant !

# messageLockingAllRepos
source: Locking all open repositories…
fr: Verrouillage de tous les dépôts ouverts…

# messageLockOpenRepos
source: Do you want to lock all open repositories? ({number} open)
fr: Voulez-vous verrouiller tous les dépôts ouverts ? ({number} ouverts)

# messageShareWithWR
source: Share with QR Code
fr: Partager avec un code QR

# messageScanQROrShare
source: Scan this with your other device or share it with your peers
fr: Scannez ceci avec votre autre appareil ou partagez-le avec vos pairs

# messageAddRepoQR
source: Import a repository using a QR code
fr: Importer un dépôt en utilisant un code QR

# messageOr
source: Or
fr: Ou

# messageAddRepoLink
source: Import a repository using a token link
fr: Importer un dépôt en utilisant un lien de jeton

# messageActionNotAvailable
source: This option is not available on read-only repositories
fr: Cette option n'est pas disponible sur le dépôts en lecture seule

# messageAccessModeDisabled
source: The permission cannot be higger than the repository current access mode: {access}
fr: La permission ne peut pas être plus élevée que le mode d'accès du dépôt courant : {access}

# messageShareActionDisabled
source: You need to select one permission to create a repository link first
fr: Vous devez d'abord sélectionner une permission pour créer un dépôt

# messageChangeExtensionAlert
source: Changing the extension of a file can make it unusable
fr: Modifier l'extension d'un fichier peut le rendre inutilisable

# messageFile
source: file
fr: fichier

# messageFiles
source: files
fr: fichiers

# messageRepoDeletionFailed
source: The repository deletion failed
fr: La suppression du dépôt a échoué

# messageRepoDeletionErrorDescription
source: We could not delete the repository "{name}"
fr: Nous n'avons pas pu supprimer le dépôt « {name} »

# messageRepoMissing
source: The repository is not there anymore
fr: Le dépôt ne se trouve plus ici

# messageRepoMissingErrorDescription
source: We could not find the repository "{name}" at the usual location
fr: Nous n'avons pas pu trouver le dépôt « {name} » à l'emplacement habituel

# messageErrorOpeningRepo
source: Error opening the repository
fr: Erreur lors de l'ouverture du dépôt

# messageErrorOpeningRepoDescription
source: Initialization of the repository {name} failed
fr: L'initialisation du dépôt {name} a échoué

# messageFileIsDownloading
source: File is already being uploaded
fr: Le fichier est déjà en cours d'envoi

# messageLogViewer
source: Log viewer
fr: Visionneuse de journaux

# messageVerbosity
source: Log verbosity
fr: Verbosité des journaux

# messageLogLevelError
source: Only Error
fr: Erreurs uniquement

# messageLogLevelErrorWarn
source: Error and Warn
fr: Erreurs et avertissements

# messageLogLevelErrorWarnInfo
source: Error, Warn and Info
fr: Erreurs, avertissements et informations

# messageLogLevelErroWarnInfoDebug
source: Error, Warn, Info and Debug
fr: Erreurs, avertissements, informations et débogage

# messageLogLevelAll
source: All
fr: Tout

# messageSaveLogFile
source: Save log file
fr: Enregistrer le fichier des journaux

# messageErrorUnhandledState
source: Error: unhandled state
fr: Erreur : État non géré

# messageUnlockRepoFailed
source: The password did not unlock the repository
fr: Le mot de passe n'a pas déverrouillé le dépôt

# messageUnlockRepoOk
source: Unlocked as a {access} replica
fr: Déverrouillé sous la forme d'une réplique de {access}

# messageUnlockUsingBiometrics
source: Unlock using biometrics
fr: Déverrouiller en utilisant la biométrie

# messagePassword
source: Password
fr: Mot de passe

# messagePasswordCopiedClipboard
source: Password copied to the clipboard
fr: Mot de passe copié dans le presse-papiers

# messageNewPasswordCopiedClipboard
source: New password copied to the clipboard
fr: Nouveau mot de passe copié dans le presse-papiers

# messageRemoveBiometricValidation
source: Remove biometric validation
fr: Validation par biométrie supprimée

# messageAlertSaveCopyPassword
source: If you remove the biometric validation, once you navigate out of this screen you wont be able to see or copy the password anymore; please save it in a secure place.
fr: Si vous supprimez la validation par biométrie, une fois que vous aurez quitté cet écran, vous ne pourrez plus voir ou copier le mot de passe ; veuillez l'enregistrer dans un endroit sûr.

# messageRemoveBiometricsConfirmation
source: Are you sure you want to remove this repository biometrics?
fr: Voulez-vous vraiment supprimer l'accès par biométrie de ce dépôt ?

# messageGeneratePassword
source: Generate password
fr: Générer un mot de passe

# messageSecureUsingBiometrics
source: Secure using biometrics
fr: Sécurisé par biométrie

# messageRemoveBiometrics
source: Remove biometrics
fr: Supprimer la biométrie

# messageRememberSavePasswordAlert
source: Remember to securely save the password; if you forget it, there is no way to retrieve it.
fr: N'oubliez pas de sauvegarder le mot de passe en toute sécurité ; si vous l'oubliez, il n'y a aucun moyen de le retrouver.

# messageBiometricValidationAdded
source: Biometric validation added for repository "{name}"
fr: Validation biométrique ajoutée au dépôt « {name} »

# messageBiometricValidationRemoved
source: Biometric validation removed
fr: Validation biométrique supprimée

# messageErrorAuthenticatingBiometrics
source: There was an error authenticathing using biometrics. Please try again
fr: Une erreur s'est produite lors de l'authentification biométrique. Veuillez réessayer

# messageErrorChangingPassword
source: There was a problem changing the password. Please try again
fr: Une erreur s'est produite lors de la modification du mot de passe. Veuillez réessayer

# messageSettingsRuntimeID
source: Runtime ID
fr: Identifiant d'exécution

# messageView
source: View
fr: Voir

# messageLocalDiscovery
source: Local Discovery
fr: Découverte locale

# messageSyncMobileData
source: Sync while using mobile data
fr: Synchroniser avec les données mobiles

# messageNATType
source: NAT type
fr: Type NAT

# messageNone
source: None
fr: Aucun

# messagePeerExchange
source: Peer Exchange
fr: Échange des pairs

# messageUnsavedChanges
source: You have unsaved changes. Do you want to discard them?
fr: Vous avez des modifications non enregistrées. Voulez-vous les annuler ?

# messageAccessingSecureStorage
source: Accessing secure storage
fr: Accéder au stockage sécurisé

# messageSavingChanges
source: Do you want to save the current changes?
fr: Voulez-vous enregistrer les modifications actuelles ?

# messageErrorAddingSecureStorge
source: Adding a local password failed
fr: L'ajout d'un mot de passe local a échoué

# messageErrorUpdatingSecureStorage
source: Updating the password in the secure storage failed
fr: La mise à jour du mot de passe dans le stockage local a échoué

# messageErrorRemovingSecureStorage
source: Removing the password from the secure storage failed
fr: La suppression du mot de passe du stockage sécurisé a échoué

# messageErrorAddingLocalPassword
source: Adding a local password failed
fr: L'ajout d'un mot de passe local a échoué

# messageErrorChangingLocalPassword
source: Changing local password failed
fr: La modification du mot de passe local a échoué

# messageErrorRemovingPassword
source: Removing the password failed
fr: La suppression du mot de passe a échoué

# messageNewPassword
source: New password
fr: Nouveau mot de passe

# messageAddLocalPassword
source: Add local password
fr: Ajouter un mot de passe local

# messageChangeLocalPassword
source: Change local password
fr: Modifier le mot de passe local

# messageRemovaLocalPassword
source: Remove local password
fr: Supprimer le mot de passe local

# messageRemovedInBrackets
source: <removed>
fr: <supprimé>

# messageGranted
source: Granted
fr: Accordé

# messagePermissionRequired
source: This permission is required
fr: Cette permission est requise

# messageGrantingRequiresSettings
source: Granting this permission requires navigating to the settings: Settings > Apps & notifications
fr: Pour accorder cette autorisation, vous devez vous rendre dans les paramètres : Paramètres > Applications et notifications

# messageCameraPermission
source: We need this permission to use the camera and read the QR code
fr: Nous avons besoin de cette permission pour utiliser l'appareil photo et lire le code QR

# messageIgnoreBatteryOptimizationsPermission
source: Allows the app to keep syncing in the background
fr: Autorise l'application à continuer la synchronisation en arrière-plan

# messageStoragePermission
source: Needed for getting access to the files
fr: Requis pour pouvoir accéder aux fichiers

# messageStorage
source: Storage
fr: Stockage

# messageCamera
source: Camera
fr: Appareil photo

# popupMenuItemCopyPassword
source: Copy password
fr: Copier le mot de passe

# popupMenuItemChangePassword
source: Change password
fr: Modifier le mot de passe

# menuItemRepository
source: Repository
fr: Dépôt

# menuItemNetwork
source: Network
fr: Réseau

# menuItemLogs
source: Logs
fr: Journaux

# menuItemAbout
source: About
fr: À propos

# statusSync
source: SYNCED
fr: SYNCHRONISÉ

# statusUnspecified
source: Unspecified
fr: Non spécifié

# iconDownload
source: Download
fr: Télécharger

# iconPreview
source: Preview
fr: Aperçu

# iconShare
source: Share
fr: Partager

# iconRename
source: Rename
fr: Renommer

# iconMove
source: Move
fr: Déplacer

# iconDelete
source: Delete
fr: Supprimer

# iconCreateRepository
source: Create a new repository
fr: Créer un nouveau dépôt

# iconAddExistingRepository
source: Import a repository
fr: Importer un dépôt

# iconAccessMode
source: Access Mode
fr: Mode d'accès
